Revit 2027 API
OverrideGraphicSettings.SurfaceForegroundPatternId Property
 The ElementId of the surface foreground fill pattern override. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SurfaceForegroundPatternId { get; }
Public ReadOnly Property SurfaceForegroundPatternId As ElementId
	Get
public:
property ElementId^ SurfaceForegroundPatternId {
	ElementId^ get ();
}
member SurfaceForegroundPatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace